# Reset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysTypeSetIterator..::..Reset Method
DistributionSysTypeSetIterator Class See Also
---
Bring the iterator back to the start of the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# ### Implements
IEnumerator..::..Reset()()()()
# Remarks
The Reset method will return the iterator back to the start of the set in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.
# See Also
DistributionSysTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace